//=============================================================================
//
// チュートリアル処理 [tutorial.h]
// Author : GP12B183 24 余　文杰
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************




enum
{
	TUTORIAL_START,			   //　GAMEに進む
	TUTORIAL_EXIT,			   //　ゲームを終了
	TUTORIAL_MAX			   //　
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);


